app/Controllers/Home.php

    public function writer($id){

        $model = new CommonModel();
        $postModel = new PostModel();

        $data['data'] =  $model->where('wsk',$id)->findAll();
        $data['meta'] = $postModel->where('w_sk',$id)->countAllResults();
        $data['write'] = $postModel->where('w_sk',$id)->orderBy('pid','DESC')->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `post`
WHERE `w_sk` = '65faf85d1bc53'
SELECT *
FROM `post`
WHERE `w_sk` = '65faf85d1bc53'
ORDER BY `pid` DESC

    public function page($id)
    {

        $model = new PostModel();

        $data['meta']=   $model->join('writer','writer.wsk = post.w_sk')->where('pid',$id)->findAll();
---
SELECT *
FROM `post`
JOIN `writer` ON `writer`.`wsk` = `post`.`w_sk`
WHERE `pid` = '8'

    public function discussion(){

        $model = new PostModel();

        $data['data']=   $model->join('writer','writer.wsk = post.w_sk')->findAll();
---
SELECT *
FROM `post`
JOIN `writer` ON `writer`.`wsk` = `post`.`w_sk`
ORDER BY `pid` DESC